// Написать программу вычисления значения функции y = f(a)

Console.Write("Введите число a -> ");

double valueDouble = Convert.ToDouble(Console.ReadLine ());

double resultY = valueDouble * valueDouble * valueDouble;

Console.WriteLine(resultY);